<?PHP
include ("const.php");
?>

<!DOCTYPE html>
<html lang="zh-cn">
<head>
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <meta http-equiv="Cache-control" content="no-cache">
    <meta http-equiv="Pragma" content="no-cache">
    <meta http-equiv="Expires" content="0">
    <meta name="description" content="泛粵大典旨在收集現時各地讀音與歷史韻書讀音，並提供向大眾一些基礎的查詢功能，同時通過泛粵表展示泛粵各地的特色字及其讀音">
    <meta name="keywords" content="粵語 泛粵 嶺南 Cantonese 廣州 粵語查詢 泛粵大典 粤语 粤典 Yue">
    <title>泛粵大典</title>
    <link rel="stylesheet" type="text/css" href="./css/about.css?<?PHP echo rand(); ?>">
    <link rel="icon" href="./img/favicon.ico">
    <script src="./js/general.js"></script>
</head>

<body>

<div id="wrapper" class="wrapper">
    <?PHP Info::showSidenav(); ?>
    <div id="container" class="container" style="">
        <button class="sidenav-show-btn" onclick="showSidenav()"></button>
        
        <div class="info">
            <h1>一、泛粵大典</h1>
            <p>目前，泛粵典旨在收集現時各地讀音與歷史韻書讀音並提供一些基礎的查詢功能，包括查字、查音，未來再繼續加入查韻（按音韻地位檢索）及查詞等功能和更多的字表。</p>
            <p>網路諸多面向公眾的粵語查詢網站大都是 「查廣州音的網站」，然而粵語不是只有廣州話，我們希望可以對各方言一視同仁，現在便是順著信息化的東風，將這些東西匯總，嘗試做成面向兼顧（有一定基礎的）大眾以及有參考需求的音韻愛好者的風格。</p>
            <br>
            <p>相比小學堂，此處各地字表、韻書數據均是由嶺南粵音群內各地學<span class="del">姐</span>者提供（詳見本文底部名單），由此地方音基本爲他等自我審查並去除猩化後的當地音。可能有少數字會被手動高舉化，但總體上還是能反映當地本來讀音情況的。</p>
            <p>爲方便對比，字頭處附了《廣韻》及polyhedron的中古拼，其表示方法同《漢字古今中外讀音查詢》。</p>
            <p>地方音表格第三、四列分別爲擴展粵拼（基於香港語言學學會粵語拼音方案，即粵拼，詳細見下補充）以及IPA記音，第五列爲備註，通常爲對破音字的例詞或說明。</p>
            <br>
            <p>查音使用擴展粵拼，支持模糊檢索，使用"%"可代表聲母、韻腹或韻尾，調號可不標表示聲調不敏感。</p>
            <br>
            <h1 id="fjb">二、泛粵字表</h1>
            <p>泛粵字表收錄泛粵粵語中相比普通話比較突出的用字，並使用擴展粵拼記錄該字在各點中的讀音，至19年7月末合計收錄2500+條；23年中計4500+條。</p>
            <br>
            <p>雖然釋義可能無法在通用多地與精確之間同時兼顧，各地記錄也會因受限於參與人的瞭解而不一定十分準確，但起碼可以將這些特色字不分地位地數位化記錄保存，同時可大致確定某字某義的使用範圍，也可反過來，爲該字提供更精細的音韻地位資訊。</p>
            <br>
            <p>其中，第A、C列分別爲<ruby>錔<rp>(</rp><rt>taap/tap/top</rt><rp>)</rp></ruby>字、泛粵綜合音。錔字不代表本字或正字，而只是基於音、義來選出的相對較爲合理的字，因此既不過分追求本字，不抵制使用口字旁俗字，也不強求作爲日常打字使用；綜合音則爲融合各選點最高舉處而成的人工音系。</p>
            <br>
            <div class="cite">
                <h3>目前使開嘅奇離法則：</h3>
                <h4>聲母：</h4>
                <p>z c s / zh ch sh：分韻精照（精i相容師韻ii，故毋再標）</p>
                <p>j/nj：分韻日母</p>
                <h4>韻母：</h4>
                <p>aa/ae/e/i：ae儘量表示二等，視乎順德等埞有冇高化；e陰聲韻儘量表示蟹同埋支白，i/e陽(入)聲韻見後</p>
                <p>o/oe：oe除唨音系表示果三合之外，亦表示果開白讀，視乎具體文白</p>
                <p>ui/ooi/yi/yu：分韻魁(ui)雖(ooi)諸(yu)韻，切要裂化精組遇(yi)視乎各埞有冇裂化</p>
                <p>im in ing / em en eng：三四等文白，儘量照顧白讀，亦考慮各方音文白比例（入聲韻同理）</p>
                <p>ing / yng：梗曾三四等，視乎鬱林等埞有冇圓脣（入聲韻同理）</p>
                <p>ong / owng：宕江，視乎鬱林等埞有冇圓脣（入聲韻同理）</p>
                <h4>聲調：</h4>
                <p>入聲 4/6：上下陽入，視乎母音長短，主要參照鬱林等地</p>
            </div>
            
            <br>
            <br>
            <h1>三、補充說明及問與答</h1>
            <h3 id="jpp">㈠ 擴展粵拼方案</h3>
            <div class="img"><img style="width:200%;" src="./img/jpp_20210626.png" alt="泛粵擴展粵拼全表"></div>
            <p>擴展粵拼基於粵拼，僅對粵拼進行了擴充，而未修改原有方案裏就有的部分。</p>
            <p>圖中，粗體表示相對較常用的。方案並未確定爲最終版。</p>
            <h3 id="tone">㈡ 聲調表</h3>
            <div class="img"><img style="width:200%;" src="./img/tone_20210626.png" alt="泛粵調值表"></div>
            <br>
            <h3>㈢</h3>
            <h3>㈣ 伺服器極小水管極低配置，嚴禁手癢DDoS，不要爬蟲（嚴肅）。</h3>
            <h3>㈤ 問與答</h3>
            <p>Ⅰ. 爲何地方音要放擴展粵拼/這個擴展粵拼有何意義而不直接用IPA</p>
            <p>ⅰ. 實際上，這裏一共有三處使用了粵拼：1.地方音展示 2.按音查字 3.泛粵表，如果僅使用IPA，先不說對大眾的門檻會升高多少，還會使各處的錄入工作變得相對麻煩，再者泛粵粵語音系相對統一，常用的擴展粵拼相對原來粵拼並未有大幅度變化，學習成本並不高；其次，地方音展示處並非完全不使用IPA，但其用在了當地偏向嚴式的表記上，一方面可更準確記錄當地音，然而也會削弱了不同地方讀音之間的聯繫，因而再補上了粵拼，這樣也可以附帶調號以表示調類情況。</p>
            <br>
            <p>（注意：不是所有地方都有偏嚴式的IPA，而且即使使用了寬式IPA也不代表就是足夠合理的，這受限於是否能有條件去分析當地實際讀音，以及字表提供者本身的口音偏差，這也是不能只使用IPA的原因之一。）</p>
            <br>
            <p>Ⅱ. 功能真少/好簡陋</p>
            <p>ⅱ. 因爲是學生，不怎麼閑，而且當時起計畫時是完全零網站開發經驗，所以…</p>
            <p>實際上，相比吳語，粵語（特指泛粵粵語，而非廣港話）相關的網站起步的確偏晚了，且經常要麼是地方團體在各玩各，要麼是一班粵皇在自嗨。儘管非廣州地區的官科文章論文研究有不少，但對普通人的距離仍是太遠了。現在作爲一群粵語民間人士，又靠著諸IT大佬的協助，而開了泛粵典計畫，衹是現在剛起步，沒辦法一下子做到面面俱到功能齊全，但姑且還算是做了一點微小的工作吧。</p>
            <br>
            <p>Ⅲ. 點真少/怎麼都是廣西的點</p>
            <p>ⅲ. 記錄完整字表還是需要一定門檻和不少時間的，而群內廣東勢力單薄，所以…</p>
            <br>
            <p>Ⅳ. 泛粵表的綜合音有何意義</p>
            <p>ⅳ.</p>
            <p class="cite">泛粵(字)表係基於各地方音共時共義比較箇理念建立嘅，因此我等力求將佢做成廣泛嘅、特色化嘅、面向諸粵嘅數據庫陣時，毋可避免要面對現實數據處理箇諸多問題，如電子數據箇排序、篩選、跨地搜索者等等。衹係爲唨便於實現以上功能，表內先提供有所謂主觀鬭成嘅「泛粵綜合音」、佢啲材料即根植於歷史粵語辭書同埋各方音箇高舉音位。邇層「綜合音」毋推薦作爲實際通音使用，而且會隨住數據源箇拓展、粵語音韻理論箇更新而改變法則。</p>
            <br>
            <p>Ⅴ. 泛粵字表爲何不放入泛粵典以便查詢</p>
            <p>ⅴ. 在未來計畫中，暫時還未得閒做。可在 <a href='https://jyutjam.org/jyutdict-android/' target='_blank'>安卓版</a> 查詢。</p>
            <br>
            <p>Ⅵ. <b>資料有誤/可以提供當地字表/參與泛粵表協作/有建議等等</b></p>
            <p>ⅵ. 歡迎聯繫。</p>
            <br>
            <p>Ⅶ. 訪問慢</p>
            <p>ⅶ. 其實伺服器並不在內地，目前已經使用 Cloudflare。</p>
            <br>
            <p>Ⅷ. 用網站查還是不方便</p>
            <p>ⅷ. <a href='https://jyutjam.org/jyutdict-android/' target='_blank'>安卓版本</a> 可用。</p>
            <br>
            <p>Ⅸ. 說普通話，做文明人 / 廣州話才是最標準的粵語</p>
            <p>ⅸ. 你書得隊。</p>
            <br>
            <h1>四、資料來源以及鳴謝</h1>（帶@號爲知乎名稱）
            <h3>㈠ 字表來源</h3>
            <p>鶴山沙坪: Sathaksamyan</p>
            <p>開平護龍: 鄧鈞</p>
            <p>台山大江: @彼岸</p>
            <p>台山斗山墟: @chands</p>
            <p>江門荷塘上: @Kwingiem</p>
            <p>江門荷塘下: @Kwingiem</p>
            <p>江門水南: @Kwingiem</p>
            <p>江門白沙: @Kwingiem</p>
            <p>江門紫萊: @Kwingiem</p>
            <p>江門沙仔尾: @Kwingiem</p>
            <p>開平沙塘: @xing/砂糖</p>
            <p>新會天湖: @Kwingiem</p>
            <p>新會羅坑: @大蛤</p>
            <p>新會會城: @Kwingiem>好爽瘾输入法</p>
            <p>江門墟頂: @Kwingiem</p>
            <p>東莞塘角: @不羁、@大渡河飞过海</p>
            <p>東莞黃麻嶺: 謝俊賢/@I</p>
            <p>江門白話: @Kwingiem</p>
            <p>廣州: @以成、@'Simon So'、@Tim、@'Ching-hung Ng'</p>
            <p>順德大良: @Uncle光</p>
            <p>中山石岐: @亘古二六亖</p>
            <p>肇慶: @Ecr-弋汐</p>
            <p>新興新城: @不羁、@大渡河飞过海</p>
            <p>陽春松柏: @不羁</p>
            <p>梧州: @大渡河飞过海</p>
            <p>南寧: @tim</p>
            <p>橫縣: alex</p>
            <p>百色: 夏桑菊></p>
            <p>桂平: B@浔人骑诗1</p>
            <p>梧州戎墟: @大渡河飞过海>《廣西蒼梧白話詞匯…》、类光源</p>
            <p>梧州扶典是: 晋州永世</p>
            <p>封川: @大渡河飞过海>《封開方言志》</p>
            <p>開建: @大渡河飞过海>《封開方言志》、阿水/B@我嘅拳头沙煲咁大</p>
            <p>蒼梧石橋: @大渡河飞过海、淩蕓訫飛</p>
            <p>蒙山: </p>
            <p>桂平尋旺: @馮景宸</p>
            <p>陸川馬坡是: 於兔</p>
            <p>北流大旺: 喇叭褲</p>
            <p>容縣: @pan473820</p>
            <p>鬱林: @暾明</p>
            <p>貴港街裏: @貴糖菠蘿、《貴港話同音字彙》</p>
            <p>靈山太平（新立）: 達陽</p>
            <p>廉州: @'Sin Yeung'>《廣西通志·漢語方言志》、互聯網</p>
            <p>湛江坡頭: @女尊控</p>
            <p>吳川吳陽: @女尊控</p>
            <p>化州下江: @白朔</p>
            <p>化州上江: @白朔</p>
            <p>欽州: @Jzit</p>
            <p>防城: [匿名]</p>
            <p>北海: @'Sin Yeung'</p>
            <p>遂溪草潭: 州</p>
            <p>遂溪: SìhngYíh</p>
            <p>湛江赤坎: SìhngYíh</p>
            <p>高州: @一优法师</p>
            <p>高州石鼓: @一优法师</p>
            <p>茂名: 潘少、@'Aleko Lau'、B@常ならむ</p>
            <p>陽春合水: @不羁</p>
            <p>陽春河口: @不羁</p>
            <p></p>
            <p>中古音（廣韻）：@王赟 Maigo《漢語古今中外讀音查詢》裏 poem 的《廣韻字音表》；</p>
            <p>簡繁異轉換字表來自<a href="https://github.com/BYVoid/OpenCC">OpenCC</a></p>
            <br>
            <h3>㈡ 技術支援鳴謝：</h3>
            <p>指南 @Zenam 等人的共同開發</p>
            <p>平姐 等人的设计协助、</p>
            <p>嶺南IT組的技術支援：小木、William、Pomfret、行者等人</p>
            <p>泛粵編纂委員會的內測測試</p>
            <p>嶺南粵音提供的吹水平臺</p>
            <br>
            <h3>㈢ 若想填表：</h3>
            <p>只需知曉非常基础的音韻學，兼之粵拼或 IPA 任一，就可以爲自己母语写字表、交及我們展示了。</p>
            <p>底表可於下方 B 站號置頂動態下載。</p>
            <h1>五、聯繫</h1>
            <p><a href="https://space.bilibili.com/410568594">嶺南粵音的 bilibili</a></p>
            <p class="del">嶺南粵音 Q 群：<!--不公開--></p>
            <p>泛粵大典 Q 群：837607356</p>
            <br>
            <p>個人 QQ：526438991</p>
        </div>
        <?PHP Info::showFooter(); ?>
    </div>
</div>
</body>

</html>
